In [2]:
!pip install sqlalchemy
!pip install pymysql

Requirement already satisfied: sqlalchemy in c:\users\sandr\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\sandr\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)
Requirement already satisfied: pymysql in c:\users\sandr\anaconda3\lib\site-packages (1.0.2)

In [3]:
import pandas as pd
import sqlalchemy as alch

In [4]:
from getpass import getpass
password = getpass("Introduce your sql password: ")

Introduce your sql password: ········

In [5]:
#Set the database, and create the connection calling the variable engine.

dbName = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)  # creating engine

#mysql+pymysql :the connection
#//root:{password}@localhost/{dbName}

In [6]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [7]:
#creating dataframe for rental_may table with total number of rentals for each customer

rental_may = pd.read_sql_query("SELECT customer_id, count(rental_id) AS total_rentals_per_customer FROM sakila.rental_may GROUP BY customer_id ORDER BY total_rentals_per_customer DESC", engine)
rental_may.head()

   customer_id  total_rentals_per_customer
0          197                           8
1          506                           7
2          109                           7
3          269                           6
4          239                           6

In [9]:
#Renaming total_rentals_per_customer column from rental_may dataframe

rental_may.rename(columns={'total_rentals_per_customer': 'total_rentings_may'}, inplace=True)

In [10]:
#creating dataframe for rental_june table with total number of rentals for each customer

rental_june = pd.read_sql_query("SELECT customer_id, count(rental_id) AS total_rentals_per_customer FROM sakila.rental_june GROUP BY customer_id ORDER BY total_rentals_per_customer DESC", engine)
rental_june.head()

   customer_id  total_rentals_per_customer
0           31                          11
1          454                          10
2          329                           9
3          295                           9
4          561                           9

In [12]:
#Renaming total_rentals_per_customer column from rental_june dataframe

rental_june.rename(columns={'total_rentals_per_customer': 'total_rentings_june'}, inplace=True)

In [13]:
len(rental_june)

590

In [14]:
len(rental_may)

520

In [ ]:
len(may_june)

In [15]:
# Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

#Merging 2 dataframes: rental_may and rental_june

may_june = rental_may.merge(rental_june, on="customer_id", how="inner")   #INNER Join, we get only costumers we rented in May and in JUne
may_june.head()

   customer_id  total_rentings_may  total_rentings_june
0          197                   8                    8
1          506                   7                    5
2          109                   7                    5
3          269                   6                    3
4          239                   6                    5

In [28]:
#creating new column

may_june['balance_renting'] = "decreased in June"

In [29]:
may_june['balance_renting'][may_june['total_rentings_june']>may_june['total_rentings_may']] = "Increase in June"

C:\Users\sandr\AppData\Local\Temp\ipykernel_21728\1020081178.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  may_june['balance_renting'][may_june['total_rentings_june']>may_june['total_rentings_may']] = "Increase in June"

In [30]:
may_june

     customer_id  total_rentings_may  total_rentings_june    balance_renting
0            197                   8                    8  decreased in June
1            506                   7                    5  decreased in June
2            109                   7                    5  decreased in June
3            269                   6                    3  decreased in June
4            239                   6                    5  decreased in June
..           ...                 ...                  ...                ...
507          234                   1                    8   Increase in June
508          431                   1                    7   Increase in June
509          351                   1                    3   Increase in June
510           10                   1                    5   Increase in June
511          136                   1                    1  decreased in June

[512 rows x 4 columns]

In [31]:
may_june['balance_renting'][may_june['total_rentings_june'] == may_june['total_rentings_may']] = "Same"

C:\Users\sandr\AppData\Local\Temp\ipykernel_21728\2454645533.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  may_june['balance_renting'][may_june['total_rentings_june'] == may_june['total_rentings_may']] = "Same"

In [32]:
may_june

     customer_id  total_rentings_may  total_rentings_june    balance_renting
0            197                   8                    8               Same
1            506                   7                    5  decreased in June
2            109                   7                    5  decreased in June
3            269                   6                    3  decreased in June
4            239                   6                    5  decreased in June
..           ...                 ...                  ...                ...
507          234                   1                    8   Increase in June
508          431                   1                    7   Increase in June
509          351                   1                    3   Increase in June
510           10                   1                    5   Increase in June
511          136                   1                    1               Same

[512 rows x 4 columns]